In [1]:

import pandas as pd
import numpy as np

In [2]:
list_1 = list(range(1,50,2))

In [3]:
print("before pandas",list_1)
print("After pandas",pd.Series(list_1))

before pandas [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49]
After pandas 0      1
1      3
2      5
3      7
4      9
5     11
6     13
7     15
8     17
9     19
10    21
11    23
12    25
13    27
14    29
15    31
16    33
17    35
18    37
19    39
20    41
21    43
22    45
23    47
24    49
dtype: int64

In [4]:
str_1 = "hello","welcome","to","pandas"
print(str_1)

('hello', 'welcome', 'to', 'pandas')

In [33]:
string_values = pd.Series(str_1)
print("After pandas str",string_values)

After pandas str 0      hello
1    welcome
2         to
3     pandas
dtype: object

In [6]:
list_2 = [10,23,44,"DSA","ML"]
print("After list to pandas",pd.Series(list_2))

After list to pandas 0     10
1     23
2     44
3    DSA
4     ML
dtype: object

In [7]:
marks = [56,78,67,87]
course =["DSA","ML","AI","SQL"]
print("Course details")
s1 = pd.Series(marks,index=course)
print(s1)

Course details
DSA    56
ML     78
AI     67
SQL    87
dtype: int64

In [8]:
print("indexing:",s1.index)
print("values",s1.values)

indexing: Index(['DSA', 'ML', 'AI', 'SQL'], dtype='object')
values [56 78 67 87]

In [9]:
data = {'DSA':34,'ML':45,'Python':55}
s2 = pd.Series(data)
print(s2)

DSA       34
ML        45
Python    55
dtype: int64

In [10]:
arr_one = np.linspace(10,80,20)
print(arr_one)
print("numpy to pandas",pd.Series(arr_one))

[10.         13.68421053 17.36842105 21.05263158 24.73684211 28.42105263
 32.10526316 35.78947368 39.47368421 43.15789474 46.84210526 50.52631579
 54.21052632 57.89473684 61.57894737 65.26315789 68.94736842 72.63157895
 76.31578947 80.        ]
numpy to pandas 0     10.000000
1     13.684211
2     17.368421
3     21.052632
4     24.736842
5     28.421053
6     32.105263
7     35.789474
8     39.473684
9     43.157895
10    46.842105
11    50.526316
12    54.210526
13    57.894737
14    61.578947
15    65.263158
16    68.947368
17    72.631579
18    76.315789
19    80.000000
dtype: float64

In [11]:
print(course)
print(data)

['DSA', 'ML', 'AI', 'SQL']
{'DSA': 34, 'ML': 45, 'Python': 55}

In [12]:
s3 = pd.Series(data,index=course)
print(s3)

DSA    34.0
ML     45.0
AI      NaN
SQL     NaN
dtype: float64

In [13]:
num_values = np.random.random(12)*10
print(num_values)
s4 = pd.Series(num_values)
print(s4)

[5.38670301 6.32221426 2.19353367 9.35014273 3.46595491 9.0579295
 5.29728949 9.23726225 1.20814225 3.42227238 9.08174295 0.00949016]
0     5.386703
1     6.322214
2     2.193534
3     9.350143
4     3.465955
5     9.057930
6     5.297289
7     9.237262
8     1.208142
9     3.422272
10    9.081743
11    0.009490
dtype: float64

In [14]:
print("s3 values:",s3)
print("show the null value:",s3.isnull())
print("show the not null value:",s3.notnull())

s3 values: DSA    34.0
ML     45.0
AI      NaN
SQL     NaN
dtype: float64
show the null value: DSA    False
ML     False
AI      True
SQL     True
dtype: bool
show the not null value: DSA     True
ML      True
AI     False
SQL    False
dtype: bool

In [15]:
print("s1 values:",s1)
print(s1>65)
print(s1[s1>65])

s1 values: DSA    56
ML     78
AI     67
SQL    87
dtype: int64
DSA    False
ML      True
AI      True
SQL     True
dtype: bool
ML     78
AI     67
SQL    87
dtype: int64

In [16]:
print(s3["AI"])
s3["AI"] = 74
print(s3)
print(s3["ML"]==55)
print(s3.DSA==45)

nan
DSA    34.0
ML     45.0
AI     74.0
SQL     NaN
dtype: float64
False
False

In [17]:
num = np.random.random(12)*10
print(num)
s5 = pd.Series(num*num).round()
print(s5)

[9.11674969 0.53145319 3.4646269  8.10884553 4.43009509 1.09943678
 5.22809795 6.22647801 8.84213109 0.45870693 5.46649036 1.20041794]
0     83.0
1      0.0
2     12.0
3     66.0
4     20.0
5      1.0
6     27.0
7     39.0
8     78.0
9      0.0
10    30.0
11     1.0
dtype: float64

In [18]:
s5.index = num.round()
print("updating s5 index round method",s5)

updating s5 index round method 9.0    83.0
1.0     0.0
3.0    12.0
8.0    66.0
4.0    20.0
1.0     1.0
5.0    27.0
6.0    39.0
9.0    78.0
0.0     0.0
5.0    30.0
1.0     1.0
dtype: float64

In [19]:
s5.name = "Square"
print("updating s5 series name",s5)

updating s5 series name 9.0    83.0
1.0     0.0
3.0    12.0
8.0    66.0
4.0    20.0
1.0     1.0
5.0    27.0
6.0    39.0
9.0    78.0
0.0     0.0
5.0    30.0
1.0     1.0
Name: Square, dtype: float64

In [20]:
s5.index.name = "num"
print("Updating index name value",s5.index)

Updating index name value Index([9.0, 1.0, 3.0, 8.0, 4.0, 1.0, 5.0, 6.0, 9.0, 0.0, 5.0, 1.0], dtype='float64', name='num')

In [ ]:
print(s5+3)

num
9.0    86.0
1.0     3.0
3.0    15.0
8.0    69.0
4.0    23.0
1.0     4.0
5.0    30.0
6.0    42.0
9.0    81.0
0.0     3.0
5.0    33.0
1.0     4.0
Name: Square, dtype: float64
num
1.0    0.0
1.0    1.0
1.0    1.0
Name: Square, dtype: float64

In [25]:
print(s5[1.0])

num
1.0    0.0
1.0    1.0
1.0    1.0
Name: Square, dtype: float64

In [22]:
s6 = pd.Series(range(10,20))
print(s6)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [23]:
s4

0     5.386703
1     6.322214
2     2.193534
3     9.350143
4     3.465955
5     9.057930
6     5.297289
7     9.237262
8     1.208142
9     3.422272
10    9.081743
11    0.009490
dtype: float64

In [24]:
s4+5

0     10.386703
1     11.322214
2      7.193534
3     14.350143
4      8.465955
5     14.057930
6     10.297289
7     14.237262
8      6.208142
9      8.422272
10    14.081743
11     5.009490
dtype: float64

In [26]:
s6[3:7]

3    13
4    14
5    15
6    16
dtype: int64

In [27]:
s6.iloc[2]

np.int64(12)

In [28]:
s6.iloc[3:7]

3    13
4    14
5    15
6    16
dtype: int64

In [29]:
age = pd.Series([23,44,27,np.nan, 99,45,76,np.nan])

In [30]:
age

0    23.0
1    44.0
2    27.0
3     NaN
4    99.0
5    45.0
6    76.0
7     NaN
dtype: float64

In [31]:
print("Sorting age",age.sort_values())

Sorting age 0    23.0
2    27.0
1    44.0
5    45.0
6    76.0
4    99.0
3     NaN
7     NaN
dtype: float64

In [32]:
print("Sort ascending",age.sort_values(ascending=False))

Sort ascending 4    99.0
6    76.0
5    45.0
1    44.0
2    27.0
0    23.0
3     NaN
7     NaN
dtype: float64

In [34]:
string_values

0      hello
1    welcome
2         to
3     pandas
dtype: object

In [35]:
string_values.sort_values()

0      hello
3     pandas
2         to
1    welcome
dtype: object

In [36]:
string_values.sort_values(ascending=False)

1    welcome
2         to
3     pandas
0      hello
dtype: object

In [37]:
s5

num
9.0    83.0
1.0     0.0
3.0    12.0
8.0    66.0
4.0    20.0
1.0     1.0
5.0    27.0
6.0    39.0
9.0    78.0
0.0     0.0
5.0    30.0
1.0     1.0
Name: Square, dtype: float64

In [38]:
s5.sort_index()

num
0.0     0.0
1.0     0.0
1.0     1.0
1.0     1.0
3.0    12.0
4.0    20.0
5.0    27.0
5.0    30.0
6.0    39.0
8.0    66.0
9.0    83.0
9.0    78.0
Name: Square, dtype: float64

In [39]:
s5.sort_index(ascending=False)

num
9.0    83.0
9.0    78.0
8.0    66.0
6.0    39.0
5.0    30.0
5.0    27.0
4.0    20.0
3.0    12.0
1.0     0.0
1.0     1.0
1.0     1.0
0.0     0.0
Name: Square, dtype: float64

In [40]:
s2

DSA       34
ML        45
Python    55
dtype: int64

In [41]:
s2.rank()

DSA       1.0
ML        2.0
Python    3.0
dtype: float64

In [42]:
s2.rank(ascending=False)

DSA       3.0
ML        2.0
Python    1.0
dtype: float64

In [43]:
data = {'Subject':['Python','Pandas','Numpy','Statistics','Gen AI'],
        "Marks":(67,78,65,55,45),
        "GPA":[3.5,4.0,4.7,5.0,4.1]}

In [45]:
#print data before convert dataframe
data

{'Subject': ['Python', 'Pandas', 'Numpy', 'Statistics', 'Gen AI'],
 'Marks': (67, 78, 65, 55, 45),
 'GPA': [3.5, 4.0, 4.7, 5.0, 4.1]}

In [46]:
#converting data into dataframe as name in df1
df1 = pd.DataFrame(data)

In [47]:
df1

      Subject  Marks  GPA
0      Python     67  3.5
1      Pandas     78  4.0
2       Numpy     65  4.7
3  Statistics     55  5.0
4      Gen AI     45  4.1

In [48]:
subject_list = ['Python','Pandas','Numpy','Statistics','Gen AI']
marks_list = [67,78,65,55,45]
gpa_list = [3.5,4.0,4.7,5.0,4.1]

In [ ]:
df2 = pd.DataFrame([subject_list,marks_list,gpa_list],index=["subject_list","marks_list","gpa_list"])
print(df2)

ValueError: Length of values (3) does not match length of index (5)